Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.ProgressStreamContent
Custom HttpContent wrapper that reports upload progress.

Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.ProgressStreamContent.#ctor(System.IO.Stream,System.IProgress{System.Int64},System.Threading.CancellationToken)
Initializes a new instance of the Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.ProgressStreamContent class.
content: The stream to upload.
progress: Progress reporter for bytes uploaded.
cancellationToken: Cancellation token.
Throws System.ArgumentNullException: Thrown if content or progress is null.

Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.ProgressStreamContent.SerializeToStreamAsync(System.IO.Stream,System.Net.TransportContext)
Serialize the HTTP content to a stream as an asynchronous operation with progress reporting.
stream: The target stream.
context: Transport context.
Returns: The task object representing the asynchronous operation.

Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.ProgressStreamContent.Dispose(System.Boolean)
Disposes the HTTP content.
disposing:  true for releasing both managed and unmanaged resources. False for only unmanaged.
Remarks:
This method does NOT dispose the underlying stream as it does not own it.
The caller is responsible for disposing the stream.
"using var fileStream = new.." in ModelExporter means ModelExporter owns the stream and thus, calls the garbage collector to dispose the stream.

Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.ProgressStreamContent.TryComputeLength(System.Int64@)
Determines whether the HTTP content has a valid length in bytes.
length: The length in bytes of the HTTP content.
Returns: true if length is a valid length; otherwise, false.

Tekla.Structures.Model.Internal.BimModelDataProduct.Tools.ProgressStreamContent.ShouldReportProgress(System.Int64,System.Int64,System.Int64)
Determines whether progress should be reported based on bytes transferred and file size.
Smaller intervals for smaller files, larger intervals for larger files.
Minimum of 256 KB between reports.
If file size is known -> select the bigger of : 256 KB OR 5% of the file.
If file size is unknown -> report every 2 MB.
Examples for 40 MBpS upload bandwidth:
1 MB file -> Approx 4 reports over 0.25 seconds -> max 10 reports/second
50 MB file -> Capped at 2 MB intervals -> Approx 2.5 reports / second
500 MB file -> Capped at 2 MB -> Approx 2.5 reports / second
totalBytes: Total size of the file being uploaded (0 if unknown).
currentBytes: Current number of bytes uploaded.
lastReportedBytes: Number of bytes at last progress report.
Returns: true if progress should be reported; otherwise, false.